In [2]:
import pandas as pd

In [5]:
df = pd.DataFrame(
    {
        "Name" : [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",             
            "Bonnell, Miss. Elizabeth",
        ],
        "Age" : [22, 35, 58],
        "Sex" : ["male", "male", "female"]
    }
)

In [6]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [7]:
display(df) #jupyter에선 display가 더 깔끔하게 나와 
print(df)#print는 쓰지않고 실습에선 display를 사용

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [8]:
ages = pd.Series([22, 35, 58], name="Age")

In [9]:
display(ages)

0    22
1    35
2    58
Name: Age, dtype: int64

In [10]:
se = pd.Series([1,2,3,6])
display(se)

0    1
1    2
2    3
3    6
dtype: int64

In [11]:
se = pd.Series([1,2,3,6],['서울','대전','대구','부산'])
display(se)

서울    1
대전    2
대구    3
부산    6
dtype: int64

In [12]:
display(se['서울']) #시리즈의 출력
display(type(se[['대구','서울','부산']]))

1

pandas.core.series.Series

In [13]:
indextest = se.index ##만들어진 시리즈에서 인덱스만 출력
valusetest = se.values#만들어진 시리즈에서 데이터 값들만을 출력

display(indextest)
display(valusetest)

Index(['서울', '대전', '대구', '부산'], dtype='object')

array([1, 2, 3, 6])

In [14]:
display(sorted(se.index)) ##sorted함수는 인덱스나 값들로 정렬
display(sorted(se.values))
se.reindex(sorted(se.index)) #reindex를 하게되면 sort후 데이터를 정렬후 사용가능

['대구', '대전', '부산', '서울']

[1, 2, 3, 6]

대구    3
대전    2
부산    6
서울    1
dtype: int64

In [15]:
se_x = pd.Series([3, 8, 5, 9], index=['서울','대구','부산','광주'])
se_y = pd.Series([2, 4, 5, 1], index=['대구','부산','서울','대전']) 
se_x+se_y #공통된 인덱스가 존재 하지 않으면 NaN으로 츨력, 존재하면 더해져서 출력

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [16]:
se.isnull()

서울    False
대전    False
대구    False
부산    False
dtype: bool

#pandas Nan처리방법 또는 Nan만 검색방법 찾아서 확인해보기

In [17]:
medal = [1,2,6,2,4,5,6,5,7,8,9]
medal_x = pd.Series(medal)
display(pd.unique(medal_x))

array([1, 2, 6, 4, 5, 7, 8, 9])

#pands의 unique()는 시리즈로 부터 값을 받아 유일한 값들만 반환한다.(중복제외)

In [18]:
data = {'alice': [1, 2, 3], 'bob': 20, 'tony': 15, 'suzy': 30,"dodo": [1,3,5,7], "mario": "pitch"}
x = pd.Series(data)
x

alice       [1, 2, 3]
bob                20
tony               15
suzy               30
dodo     [1, 3, 5, 7]
mario           pitch
dtype: object

사전 형식(Dictionary)의 데이터를 Series로 변환 가능

In [19]:
y = x[1:3]

이런식으로 특정 벙위 내에만 검색도 가능하다

In [20]:
s = pd.Series(["a","b","c"],name="vals")
s

0    a
1    b
2    c
Name: vals, dtype: object

In [21]:
df = s.to_frame()
display(df)

  vals
0    a
1    b
2    c

In [22]:
dataFrame = {'age' : [23,43,12,45],
            'name':['민준','현우','서연','동현'],
            'height':[175.3,180.3, 165.8,172.7]}
x_data = pd.DataFrame(dataFrame, columns = ['name','age','height','test'])
x_data

  name  age  height test
0   민준   23   175.3  NaN
1   현우   43   180.3  NaN
2   서연   12   165.8  NaN
3   동현   45   172.7  NaN

Dictionary형태의 테이블이 없으면 생성은 되지만 NaN형태로 출력이 됌.

In [23]:
display(x_data.name) #name의 데이터들만 출력됌

0    민준
1    현우
2    서연
3    동현
Name: name, dtype: object

아래와 위의 Data type들도 매우 중요함

In [24]:
display(x_data.height, x_data.age)

0    175.3
1    180.3
2    165.8
3    172.7
Name: height, dtype: float64

0    23
1    43
2    12
3    45
Name: age, dtype: int64

In [25]:
display(x_data['age'][0:2])

0    23
1    43
Name: age, dtype: int64

이렇게 하면 슬라이싱한 0번째부터 2번째 까지의 serise만 출력

In [26]:
ary = [[1,2],[3,4],[5,6]]
ary_data = pd.DataFrame(ary, columns=['first','second']) #컬럼명 지정
display(ary_data)

   first  second
0      1       2
1      3       4
2      5       6

In [27]:
ary_data.iloc[1] #1행만 출력

first     3
second    4
Name: 1, dtype: int64

In [28]:
ary_data.iloc[:,-1] #모든 행의 마지막 데이터만 출력함

0    2
1    4
2    6
Name: second, dtype: int64

#슬라이싱을 통해서 특정 행만 출력이 가능하고 [ ][ ] 2개를 사용하면 그 위치에 있는
정보만 출력도 가능함, [:,-1] 예로 위와 같이 쓰면 모든 행의 마지막 데이터만 출력함

In [29]:
##응용
ary_data.iloc[0:2, -1]

0    2
1    4
Name: second, dtype: int64

In [4]:
csv_dp = pd.read_csv("test/test.csv", sep=",")
csv_dp.tail()

,id,keyword,location,text
3258,10861,NaN,NaN,EARTHQUAKE SAFETY LOS ANGELES ÛÒ SAFETY FASTE...
3259,10865,NaN,NaN,Storm in RI worse than last hurricane. My city...
3260,10868,NaN,NaN,Green Line derailment in Chicago http://t.co/U...
3261,10874,NaN,NaN,MEG issues Hazardous Weather Outlook (HWO) htt...
3262,10875,NaN,NaN,#CityofCalgary has activated its Municipal Eme...

In [17]:
ary = [[1,2], [3,4], [5,6],[7,8],[9,10]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
bools = [False, True, False, True, False]
display(data)
display(data['Second'][bools])

   First  Second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10

1    4
3    8
Name: Second, dtype: int64

In [18]:
ary = [[1,2], [3,4], [5,6],[7,8],[9,10]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
data.mean()

First     5.0
Second    6.0
dtype: float64

In [26]:
display(data.mean())
display(data.mean(axis=1)) ##mean max

First     5.0
Second    6.0
dtype: float64

0    1.5
1    3.5
2    5.5
3    7.5
4    9.5
dtype: float64